fr = open('D:/bill.txt','r',encoding='UTF-8')
fw = open('D:/bill.txt.bak','w',encoding='UTF-8')
for line in fr:
    line = line.strip()
    if line.split('，')[-1] == '测试':
        continue
    fw.write(line)
    fw.write('\n')
fr.close()
fw.close()
'''bill.txt
name,date,money,type,remarks
总经理，2022-01-01，100000，消费，正式
总经理，2022-01-02，300000，收入，正式
总经理，2022-01-03，100000，消费，测试
辣椒酱，2022-01-01，300000，收入，正式
辣椒酱，2022-01-02，100000，消费，测试
辣椒酱，2022-01-03，100000，消费，正式
辣椒酱，2022-01-04，100000，消费，测试
辣椒酱，2022-01-05，500000，收入，正式
中西医，2022-01-01，100000，消费，正式
中西医，2022-01-02，500000，收入，正式
中西医，2022-01-03，900000，收入，测试
网络化，2022-01-01，500000，消费，正式
网络化，2022-01-02，300000，消费，测试
网络化，2022-01-03，900000，收入，正式
领导好，2022-01-01，300000，消费，测试
领导好，2022-01-02，100000，消费，正式
领导好，2022-01-03，300000，消费，正式
'''